---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsComponentConnection.ElementId
source: html/b474d62f-f49e-1800-46c9-8236b69d9cf9.htm
---
# Autodesk.Revit.DB.Architecture.StairsComponentConnection.ElementId Property

The element Id of connected stairs component in the stairs connection.

## Syntax (C#)
```csharp
public ElementId ElementId { get; }
```